# Joining
Joining is a convinient method for combining the columns of two potentially differently-indexed Dataframes into a single result Dataframe.

In [3]:
import pandas as pd
import numpy as np

In [4]:
left=pd.DataFrame({'A':['A0','A1','A2'],
                  'B':['B0','B1','B2']},
                  index=['K0','K1','K2'])

right=pd.DataFrame({'C':['C0','C2','C3'],
                   'D':['D0','D2','D3']},
                   index=['K0','K2','K3'])

In [5]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [6]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [7]:
#display left join
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [8]:
#displays right join
right.join(left)

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN

# Missing Data
Few convinient methods to deal with Missing Data in Pandas:

In [51]:
df=pd.read_csv('D:\shru\SEM 5\ML\\df11.csv')

In [52]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [53]:
#by default its taking axis=0(column)
df.dropna()

     A    B  C
0  1.0  5.0  1

In [54]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [55]:
#setting threshold
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [56]:
#It replaces with a specific value
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [57]:
#It replaces with a specific value, 0 makes it recognize as a int n makes it float
df.fillna(value=0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [58]:
df['A'].fillna(value=df['A'].mean(),inplace=True)

In [59]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3

In [60]:
df.iloc[1]=df.iloc[1].fillna(value=df.iloc[1].mean())
df.iloc[1]

A    2.0
B    2.0
C    2.0
Name: 1, dtype: float64

In [61]:
df

     A    B    C
0  1.0  5.0  1.0
1  2.0  2.0  2.0
2  1.5  NaN  3.0

In [62]:
df['B']=df['B'].fillna(value=df['B'].mean())
df

     A    B    C
0  1.0  5.0  1.0
1  2.0  2.0  2.0
2  1.5  3.5  3.0

# Operations
There are lot of operations with pandas that will be useful.

In [63]:
df=pd.read_csv('D:\shru\SEM 5\ML\\df12.csv')
df

   A    B    C
0  1  444  abc
1  2  555  def
2  3  666  ghi
3  4  444  xyz

Info on Unique Values

In [64]:
df['B'].unique()

array([444, 555, 666], dtype=int64)

In [65]:
#no of unique values
len(df['B'].unique())

3

In [66]:
#no of unique values
df['B'].nunique()

3

In [67]:
#to count values
df['B'].value_counts()

444    2
555    1
666    1
Name: B, dtype: int64

Selecting Data

In [72]:
#returns values greater than 2
df['A']>2

0    False
1    False
2     True
3     True
Name: A, dtype: bool

In [73]:
df[df['A']>2]

   A    B    C
2  3  666  ghi
3  4  444  xyz

In [74]:
#AND CONDITION
df[(df['A']>2)&(df['B']==444)]

   A    B    C
3  4  444  xyz

# Functions

In [75]:
def times2(x):
    return x*2

In [76]:
df['A'].apply(times2)

0    2
1    4
2    6
3    8
Name: A, dtype: int64

In [77]:
#Applying inbuilt operator
df['C'].apply(len)

0    3
1    3
2    3
3    3
Name: C, dtype: int64

In [78]:
df['A'].sum()

10

Permanently Removing column

In [79]:
del df['A']

In [80]:
df

     B    C
0  444  abc
1  555  def
2  666  ghi
3  444  xyz

In [81]:
#returns names of columns
df.columns

Index(['B', 'C'], dtype='object')

In [82]:
#it gives index
df.index

RangeIndex(start=0, stop=4, step=1)

Sorting anordering Dataframe

In [86]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [83]:
df.sort_values(by='B')

     B    C
0  444  abc
3  444  xyz
1  555  def
2  666  ghi

Find null values or check for null values

In [84]:
df.isnull()

       B      C
0  False  False
1  False  False
2  False  False
3  False  False

In [85]:
df=pd.read_csv('D:\shru\SEM 5\ML\\df13.csv')
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [87]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Group BY

In [88]:
df=pd.read_csv('D:\shru\SEM 5\ML\\df14.csv')
df

  Company  Person  Sales
0    GOOG     Ram     20
1    GOOG  Ramesh    120
2    MSFT   Shyam    340
3    MSFT   Kumar    124
4      FB    Rita    243
5      FB   Gopal    350

Can use groupby() method to group rows together based off as column name. For instance grouping based off a company. This will create a DataframeFroupby object

can save it in new variable

In [89]:
by_comp=df.groupby("Company")

Call aggregate methods off the object

In [90]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG      70.0
MSFT     232.0

In [91]:
by_comp.max()

         Person  Sales
Company
FB         Rita    350
GOOG     Ramesh    120
MSFT      Shyam    340

In [92]:
by_comp.min()

        Person  Sales
Company
FB       Gopal    243
GOOG       Ram     20
MSFT     Kumar    124

In [93]:
by_comp.sum()

         Sales
Company
FB         593
GOOG       140
MSFT       464

In [94]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [95]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      70.710678
MSFT     152.735065

In [96]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0   70.0   70.710678   20.0   45.00   70.0   95.00  120.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [97]:
by_comp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000   70.000000  232.000000
      std     75.660426   70.710678  152.735065
      min    243.000000   20.000000  124.000000
      25%    269.750000   45.000000  178.000000
      50%    296.500000   70.000000  232.000000
      75%    323.250000   95.000000  286.000000
      max    350.000000  120.000000  340.000000